<template>
    <div class="dianzi">
        <div class="item rule">
            <div class="title display-flex midum-white-txt align-center"><em class="dot"></em><span class="gradient-text">电子竞技一般规则?</span></div>
            <p><em>1.如果比赛没有完成（例如：队员退赛、取消资格或游戏服务器的问题）所有该赛事的投注将被视为无效</em></p>
            <p><em>2.如赛事在原定比赛前提前开始，在赛事开始后的所有注单视为无效，滚球投注除外。</em></p>
            <p><em>3.如果一个队员/队伍在比赛开始前给出至少一个地图的轻易获胜，所有投注在该赛事的注单将被视为无效，除非这个优势在该投注市场已经很明显。</em></p>
            <p><em>4.如地图/回合的数量和该投注市场所显示的不一致，所有投注将被视为无效。</em></p>
            <p><em>5.如一个队伍使用一个已知的昵称来比赛或者和至少一个官方玩家游戏，所有的投注视为有效。</em></p>
            <p><em>6.如一个队伍或者两个队伍有较少队员进行比赛，所有的投注视为有效。</em></p>
            <p><em>7.一旦比赛开始或者已经杀死，所有投注在个别地图的注单视为有效，将根据官方宣布的赢家计算，包含比赛中队员退赛、取消资格和游戏服务器的问题（延迟/ DDOS）</em></p>
            <p><em>8.如果比赛为轻易获胜的判决结果，所有的投注将被视为无效，除非投注在单一已经完成的地图</em></p>
            <p><em>9.所有的投注将按照官方正式公布的相关赛果进行结算。如果一场比赛一直在进行（例如：游戏出现BUG或者游戏服务器问题），游戏将立即被通知重制，官方结果适用。</em></p>
        </div>

        <div class="item rule">
            <div class="title display-flex midum-white-txt align-center"><em class="dot"></em><span class="gradient-text">电子竞技投注类型?</span></div>

            <div class="list">
                <p class="title">独赢</p>
                <p>1.预测谁将会赢得这场比赛，任何形式的加时或补时将予以计算在内。</p>
            </div>

            <div class="list">
                <p class="title">让分</p>
                <p>1.预测计算让分结果胜者。任何形式的加时或补时将予以计算在内。</p>
                <p>2.电子竞技赛中的让分投注，将授权某队或队员，在地图或回合中处于劣势的一方前面会显示+号，例如：<br>
                    a.队员A -1.5 1.88 <br>
                    b.队员B +1.5 1.88 <br>
                    c.如果队员A取得净胜两个或以上地图的胜利，则队员A为胜出选项，队员B为输的选项。如果队员A取得净胜1个地图或队员B赢了，则队员B为胜出选项，队员A为输的选项。
                </p>
                <p>3.在电子竞技赛事中，让分可被视为让回合/地图或其他计算方式，具体取决于相关赛事。让分盘口类型仅会显示让分。 （例如，在反恐精英让分是受让回合，而在魔兽中是让地图数。</p>
                <p>4.在单一的反恐精英地图中，如果一场比赛已经开始但未完成（一些回合结束以后队员退赛或取消资格），投注在独赢盘口的注单根据官方宣布的赢家结算，然而投注在回合让分盘的注单将视为无效。</p>
            </div>

            <div class="list">
                <p class="title">大/小</p>
                <p>1.预测在比赛中的总地图数/回合数是否大于或小于盘口数，任何形式的额外时间或加时赛均计算在内。</p>
            </div>

            <div class="list">
                <p class="title">滚球</p>   
                <p>1.结算是以0-0的比分在比赛结束后按盘口开出的让回合或地图数做裁决.投注当时的比分对结算没有影响.</p>
                <p>2.如果比赛重新开始，所有在该比赛的滚球投注将被视为无效。</p>
            </div>

            <div class="list">
                <p class="title">加注 /特别</p>   
                <p>一旦比赛开始，如赛果已经明确，所有投注以下盘口的注单视为有效。反之，其中一个条件没有满足或者没有赢家，所有的注单将退回本金。</p>
            </div>

            <div class="list">
                <p class="title">以下条款描述提供的不同类型的加注和特别投注：</p>       
                <p>1.比赛打和-比赛最终是否打和</p>
                <p>2.赢家-单一地图的赢家</p>
                <p>3.第一血-最先杀死对方得分的队伍</p>
                <p>4.首队先到达10杀-最先对对方造成10杀的队伍</p>
                <p>5.持续时间-地图比赛总持续时间，根据游戏内的计时器</p>
                <p>6.配对最高击杀数-获得最高击杀数的玩家</p>
                <p>7.配对最高死亡数-获得死亡次数最高的玩家</p>
                <p>8.GODLIKE会出现-任何队员的杀人数达到9个</p>
                <p>9.信使被击杀-任何信使被其中一个队伍击杀</p>
                <p>10.第一回合赢家（手枪局）-一个地图中第一回合赢家（手枪局）</p>
                <p>11.第十六回合赢家（手枪局）-一个地图中第十六回合赢家（手枪局）</p>
                <p>12.首队先得5分-最先获胜5回合的队伍</p>
                <p>13.首个男爵击杀-最先杀死第一个男爵的队伍</p>
                <p>14.首个小龙击杀-最先杀死第一个小龙的队伍</p>
                <p>15.首个罗山击杀-最先杀死第一个罗山的队伍</p>
                <p>16.摧毁首个防御塔-最先摧毁对方防御塔的队伍，包括对方队伍自毁防御塔</p>
                <p>17.摧毁首个炮塔-最先摧毁对方炮塔的队伍</p>
            </div>
        </div>
    </div>
</template>

<style scoped lang="less">
.dianzi{
    .item{
        padding: 10px;
        margin-bottom: 14px;
        background-color: rgba(38,38,38,1);
        box-shadow:0px 0px 8px 10px rgba(0, 0, 0, 0.45);
        .title{
            margin-bottom: 10px;
        }
        p{
            span{
                color: #fff;
            }
            em{
                color: #6C6C6C
            }
        }
        &.rule{
            p{
                margin-top: 14px;
            }
        }
        .list{
            margin-top: 14px;
            .title{
                color: #fff;
                margin-bottom: 0;
            }
            p:not(title){
                color: #6C6C6C;
                margin-top: 0;
            }
        }
    }
}
</style>
